04_open_bottom/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    atmosphere
    {
        type            patch;
        nFaces          800;
        startFace       69200;
    }
    leftWall
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1200;
        startFace       70000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightWall;
    }
    rightWall
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1200;
        startFace       71200;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftWall;
    }
    frontWall
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1200;
        startFace       72400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  backWall;
    }
    backWall
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1200;
        startFace       73600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  frontWall;
    }
)

// ************************************************************************* //
